<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="GENERATOR" content="Mozilla/4.5 [fr] (Win98; I) [Netscape]">
   <title>Fret administrator</title>
</head>
<body>
<a href="fretwiz.htm"><img SRC="backline.jpg" ALT="backline.jpg (420 octets)" BORDER=0 height=15 width=15 align=LEFT></a>
<center>
<p><img SRC="logobw1.jpg" ALT="logobw1.jpg (15333 octets)" height=78 width=50 align=RIGHT></center>

<hr>
<center><table BORDER CELLPADDING=5 >
<tr>
<td><font size=+3>Fret administrator</font></td>
</tr>
</table></center>

<p><a href="#Présentation fretadm">Pr&eacute;sentation</a>
<br><a href="#Fonctionnement fretadm">Fonctionnement</a>
<br><a href="#L'arborescence DataFret fretadm">L'arborescence DataFret</a>
<br><a href="#Description des éléments fretadm">Description des &eacute;l&eacute;ments</a>
<br><a href="#Les Menus">Les menus</a>
<p><a href="fretwiz.htm"><img SRC="backline.jpg" ALT="backline.jpg (420 octets)" BORDER=0 height=15 width=15 align=LEFT></a>
<br>
<hr>
<ol>
<li>
<a NAME="Présentation fretadm"></a><u>Pr&eacute;sentation</u></li>
</ol>

<blockquote>Le Fret Administrator est un outils d'administration du Data
Fret. Il donne la possibilit&eacute; &agrave; l'administrateur de se balader
dans l'arborescence, simplement, rapidement et efficacement, tout en ayant
une description de sa position dans l'arborescence. De plus, il automatise
les nombreuses manipulations de fichiers qu'ils faut effectuer pour cr&eacute;er
un nouveau <b>wagon</b> et mettre &agrave; disposition les patchs.</blockquote>

<ol>
<li value="2">
<a NAME="Fonctionnement fretadm"></a><u>Fonctionnement</u></li>
</ol>

<blockquote><font size=+0>A l’ouverture, deux parties composent l’interface
utilisateur. La premi&egrave;re (I) sert &agrave; se balader dans l’arborescence
Fret, l’autre (II) &agrave; donner une description sur la s&eacute;lection
de la partie I. Un click droit sur une des s&eacute;lections au niveau
de l’arborescence fera appara&icirc;tre un menu contextuel proposant d’ajouter
un <b>wagon</b>, ou d'avoir acc&egrave;s &agrave; sa description. Si l'<b>avant-dernierwagon</b>
est s&eacute;lectionn&eacute; (celui qui est valide, le dernier
<b>wagon</b>
servant de bouchon et ne dispose pas de patch), il peux &ecirc;tre d&eacute;sactiv&eacute;
pour rendre celui qui le pr&eacute;c&egrave;de actif. Cela est utile si
un probl&egrave;me apparait au moment de l'installation.</font></blockquote>

<center><img SRC="inter1.jpg" ALT="inter1.bmp (433002 octets)" height=331 width=436></center>

<blockquote><i>Dans cet exemple, le <b>tube </b>"Pige Mensuel" est s&eacute;lectionn&eacute;
par un click droit de la souris. Cela fait apparaitre un menu contextuel,
et la description li&eacute; &agrave; ce <b>tube</b>. Un click gauche de
la souris ne ferais apparaitre que la description.</i>
<br><i>L'arborescence est manipulable d'un niveau &agrave; un autre grace
aux boutons&nbsp;<img SRC="plus.jpg" ALT="plus.bmp (450 octets)" height=11 width=11>
et&nbsp;<img SRC="moins.jpg" ALT="moins.bmp (450 octets)" height=11 width=11>.
Ici, Les <b>m&eacute;dias</b> Radio et T&eacute;l&eacute;vision sont &eacute;tendues.
Ils font apparaitre chacun une liste de <b>tubes.</b> Divers est un <b>m&eacute;dia-tube-wagon</b></i>.</blockquote>

<ol>
<li type="disc" value="3">
<a NAME="L'arborescence DataFret fretadm"></a><u>L'arborescence DataFret</u></li>
</ol>

<blockquote>voir <a href="fretwiz.htm#Description">Description</a></blockquote>

<ol>
<li type="disc" value="4">
<a NAME="Description des éléments fretadm"></a><u>Description des &eacute;l&eacute;ments</u></li>

<br>&nbsp;
<div type="disc" value="4">La partie du haut donne la date et l'heure de
cr&eacute;ation, ainsi que l'endroit ou se trouve l'&eacute;l&eacute;ment
s&eacute;lectionn&eacute;.</div>

<div type="disc" value="4">La parite du milieu donne la liste des &eacute;l&eacute;ments
&agrave; disposition dans le <b>wagon</b> s&eacute;lectionn&eacute;.</div>

<div type="disc" value="4">La partie du bas donne une description du <b>m&eacute;dia</b>
ou du
<b>tube</b> s&eacute;lectionn&eacute;.</div>
</ol>

<ol>
<li type="disc" value="5">
<a NAME="Les Menus"></a><u>Les Menus</u></li>
</ol>

<blockquote><img SRC="menu1.jpg" ALT="menu1.bmp (79178 octets)" height=131 width=201 align=CENTER>&nbsp;&nbsp;&nbsp;
[Menu standard]
<ul><i><u>N</u>ouveau</i> : <font size=+0>La cr&eacute;ation du nouveau
<b>wagon</b>
s’effectue pas &agrave; pas. Les diverses &eacute;tapes qui constituent
l’installation se d&eacute;roulent successivement avec la possibilit&eacute;
d’un retour en arri&egrave;re. La premi&egrave;re boite de dialogue est
le choix du <b>m&eacute;dia</b> et du tube. Puis suit la s&eacute;lection
des patchs et autres fichiers qui seront install&eacute;s. Ensuite, la
saisie du message de mise &agrave; jour du Fret doit &ecirc;tre saisie.
Enfin, il est propos&eacute; de visualiser les fichiers de configuration
pour parfaire &agrave; l'installation.</font></ul>

<center><table BORDER CELLPADDING=3 WIDTH="387" HEIGHT="741" >
<tr>
<td WIDTH="377" HEIGHT="731">
<center><img SRC="mediatube.jpg" ALT="mediatube.bmp (143470 octets)" height=197 width=242>
<br><i><font size=+0>Etape 1 : choix du m&eacute;dia et du tube.</font></i>
<p><img SRC="patch.jpg" ALT="patch.bmp (208526 octets)" height=253 width=274>
<br><i>Etape 2 : choix du patch ou des fichiers</i>
<p><img SRC="message.jpg" ALT="message.bmp (174354 octets)" height=175 width=332>
<br><i>Etape 3 : Edition du message de fin</i></center>
</td>
</tr>
</table></center>

<hr width="50%">
<p><img SRC="menu21.jpg" ALT="menu21.bmp (19854 octets)" height=66 width=99 align=CENTER>&nbsp;&nbsp;&nbsp;
[Menu Contextuel hors <b>avant-dernier wagon</b>]
<ul>
<li>
<i><u>N</u>ouveau</i> : voir le Menu standard</li>

<br><i><u>P</u>ropri&eacute;t&eacute;s</i> : Ouvre une boite de propri&eacute;t&eacute;s
utilis&eacute; pour donner une description du <b>m&eacute;dia</b>, <b>tube</b>
ou <b>wagon</b>. Le texte a inscrire dans le cadre d'&eacute;dition est
celui qui apparait dans la partie II de l'interface utilisateur, au niveau
"commentaire" pour le <b>m&eacute;dia</b> et <b>tube</b>, au niveau "Outils
mis en place" pour le <b>wagon</b>. Tous les caract&egrave;res sont accept&eacute;s.
<br>La description d'un <b>wagon</b> est plus sp&eacute;cifique : cela
concerne les patchs mis &agrave; disposition dans ce <b>wagon</b>. A l'affichage,
dans la partie II de l'interface, quatre lignes sont disponibles. Chaque
ligne est une description d'un patch (ne devant pas d&eacute;passer 40
caract&egrave;res, ne devant pas contenir de retour &agrave; la ligne).
Au formatage, c'est &agrave; dire &agrave; la saisie du texte informatif
dans la boite propri&eacute;t&eacute;s, les descriptions sont s&eacute;par&eacute;s
d'un&nbsp; point virgule.</ul>

<center><img SRC="propriete2.jpg" ALT="propriété2.bmp (576630 octets)" height=336 width=572></center>

<blockquote><i>Dans cet example, un click droit sur le wagon m2 a affich&eacute;
le menu contextuel et le champ Propri&eacute;t&eacute;s a &eacute;t&eacute;
s&eacute;lectionn&eacute;. La boite de dialogue Propri&eacute;t&eacute;s
apparait avec la d&eacute;finition des outils mis &agrave; disposition
dans m2. Chaque d&eacute;finition est s&eacute;par&eacute; par un point-virgule
au formatage. A l'affichage, chaque d&eacute;finition est dans une ligne.</i></blockquote>

<hr width="50%">
<p><img SRC="menu22.jpg" ALT="menu22.bmp (19854 octets)" height=66 width=99 align=CENTER>&nbsp;&nbsp;&nbsp;
[Menu Contextuel <b>avant-dernier wagon</b>]
<ul>
<li>
<i><u>N</u>ouveau</i> : voir le Menu standard</li>

<li>
<i>D&eacute;sactiver</i> : Cela concerne l'avant dernier wagon. Par d&eacute;faut,
un nouveau <b>wagon</b> est actif. Si un probl&egrave;me est apparu, ou
si cela ne convient pas, d&eacute;sactiver le <b>wagon</b> le rend inaccessible
aux clients. La correction du <b>wagon</b> doit s'op&eacute;rer alors manuellement.
Puis il peut &ecirc;tre rendu actif de nouveaux.</li>

<li>
<i><u>P</u>ropri&eacute;t&eacute;s</i> : voir Menu Contextuel hors <b>avant-dernier
tube</b></li>
</ul>
</blockquote>
<a href="fretwiz.htm"><img SRC="backline.jpg" ALT="backline.jpg (420 octets)" BORDER=0 height=15 width=15 align=LEFT></a>
<br>
<hr><font size=-1>Cr&eacute;ation&nbsp; : Lundi 7 Juin 1999</font>
<br><font size=-1>Derni&egrave;re modification : Mercredi 9 Juin 1999</font>
<br><font size=-1>VLF</font>
</body>
</html>
